
## Plan Result

[CI link](https://github.com/marwenbhriz/gsTerraform/actions/runs/9871602317)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.address.google_compute_global_address.default
  * module.gcr.google_artifact_registry_repository.benhriz-repo
  * module.gcs.google_storage_bucket.benhriz-terraform
  * module.hello.null_resource.default
  * module.network.google_compute_network.benhriz-vpc
  * module.network.google_compute_subnetwork.benhriz-subnetwork
  * module.pubsub.google_pubsub_topic.notifications


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.address.google_compute_global_address.default will be created
  + resource "google_compute_global_address" "default" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "lb-address"
      + prefix_length      = (known after apply)
      + project            = "grasys-study"
      + self_link          = (known after apply)
    }

  # module.gcr.google_artifact_registry_repository.benhriz-repo will be created
  + resource "google_artifact_registry_repository" "benhriz-repo" {
      + create_time      = (known after apply)
      + description      = "benhriz docker repository"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "REMOTE_REPOSITORY"
      + name             = (known after apply)
      + project          = "grasys-study"
      + repository_id    = "benhriz-upstream-repo"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + remote_repository_config {
          + description = "docker hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }
        }
    }

  # module.gcs.google_storage_bucket.benhriz-terraform will be created
  + resource "google_storage_bucket" "benhriz-terraform" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "benhriz-terraform-gke-files"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 1
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 5
              + with_state            = (known after apply)
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = true
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.hello.null_resource.default will be created
  + resource "null_resource" "default" {
      + id = (known after apply)
    }

  # module.network.google_compute_network.benhriz-vpc will be created
  + resource "google_compute_network" "benhriz-vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "benhriz-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "grasys-study"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.network.google_compute_subnetwork.benhriz-subnetwork will be created
  + resource "google_compute_subnetwork" "benhriz-subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "benhriz-subnet-1a"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "benhriz-subnetwork"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "grasys-study"
      + purpose                    = (known after apply)
      + region                     = "asia-northeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.pubsub.google_pubsub_topic.notifications will be created
  + resource "google_pubsub_topic" "notifications" {
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "86600s"
      + name                       = "notifications"
      + project                    = "grasys-study"
      + terraform_labels           = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-apply","PRNumber":7,"Program":"tfcmt","SHA1":"0972b608451a8f0bc892dbda77bd5605275d4de8","Vars":{},"WorkflowName":"terraform plan"} -->